from random import choice, randrange

LUNCHES = ["Гороховый суп",
           "Борщ",
           "Суп куриный с картофелем и морковкой",
           "Суп куриный с гречкой",
           "Суп куриный с макаронами",
           "Суп куриный с щавелем",
           "Суп рыбный",
           "Суп-пюре грибной",
           "Окрошка",
           "Суп с фрикадельками",
           ]

MEATS = ["Куриные бедра тушеные",
         "Куриные сердца тушеные",
         "Куриная печень тушеная",
         "Куриные голени тушеные",
         "Котлеты из свино-говяжъего фарша",
         "Котлеты из куриного фарша",
         "Сосиски отварные",
         "Фарш тушеный",
         "Грибы жареные",
         "Рыба жаренная в кляре",
         "Рыба запеченая",
         "Запеканка со свино-говяжьим фаршем",
         "Запеканка с куриным фаршем",
         "Плов",
         "Пельмени",
         "Макароны по-флотски"
         ]


GARNISHES = ["Картофельное пюре",
             "Картофель отварной кусочками",
             "Рис отварной",
             "Греча отварная",
             "Макароны",
             "Спагетти",
             ]


def pick_lunch():
    lunch = choice(LUNCHES)
    print("\n\tНа обед будет: ", lunch, ".", sep='')


def pick_main_course():
    number_m = randrange(len(MEATS))
    meat = MEATS[number_m]
    garnish = choice(GARNISHES)

    if number_m > 10:
        print("\tНа ужин будет: ", meat, ".\n", sep='')
    else:
        print("\tНа ужин будет: ", meat, " c ", garnish, ".\n", sep='')


def main():
    while True:
        pick_lunch()
        pick_main_course()
        answer = input(
            "Пойдет? (если да, нажмите 'y', иначе нажмите 'enter') > ")
        print('-' * 90)
        if answer == 'y':
            break


if __name__ == '__main__':
    main()
