from random import choice, randrange


def pick_lunch():
    lunch_types = ["Гороховый суп",
               "Борщ",
               "Суп куриный с картофелем и морковкой",
               "Суп куриный с гречкой",
               "Суп куриный с макаронами",
               "Суп куриный с щавелем",
               "Суп рыбный",
               "Суп-пюре грибной",
               "Окрошка",
               "Суп с фрикадельками",
               ]
    lunch = choice(lunch_types)
    print("На обед будет: ", lunch, ".", sep='')


def pick_main_course():
    meat_types = ["Куриные бедра тушеные",
              "Куриные сердца тушеные",
              "Куриная печень тушеная",
              "Куриные голени тушеные",
              "Котлеты из свино-говяжъего фарша",
              "Котлеты из куриного фарша",
              "Сосиски отварные",
              "Фарш тушеный",
              "Грибы жареные",
              "Рыба жаренная в кляре",
              "Рыба запеченая",
              "Запеканка со свино-говяжьим фаршем",
              "Запеканка с куриным фаршем",
              "Плов",
              "Пельмени",
              "Макароны по-флотски"
              ]

    garnish_types = ["Картофельное пюре",
                 "Картофель отварной кусочками",
                 "Рис отварной",
                 "Греча отварная",
                 "Макароны",
                 "Спагетти",
                 ]
    
    len_meats = len(meat_types)
    number_m = randrange(len_meats)
    meat = meat_types[number_m]
    garnish = choice(garnish_types)

    if number_m >= 11:
        print("На ужин будет: ", meat, ".", sep='')
    else:
        print("На ужин будет: ", meat, " c ", garnish, ".", sep='')


def main():
    while True:
        pick_lunch()
        pick_main_course()
        answer = input("Пойдет? (если да, нажмите 'y', иначе нажмите 'enter')")
        print('-' * 15)
        if answer == 'y':
            break


if __name__ == '__main__':
    main()
